In [1]:
import pandas as pd
import numpy as np

**Loading, cleaning, transforming and rearranging** take up 80% or more of an analyst's time.  

Sometimes the way that data is stored in files or databases is not in the right format for a particular task. Many researchers choose to do ad hoc processing of data from one form to another using a general-purpose programming language, like Python, Perl, R or Java to manipulate data into the right form.

# 1. Handling Missing Data

For numeric data, pandas uses the floating-point value **NaN**(Not a Number) to represent missing data. (*sentinel value*)

In [2]:
string_data = pd.Series(['a','bb','ccc',np.nan, 'dddd'])
string_data

0       a
1      bb
2     ccc
3     NaN
4    dddd
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [4]:
string_data[0] = None # Python build-in object
string_data.isnull()

0     True
1    False
2    False
3     True
4    False
dtype: bool

* **dropna**: Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.  
* **fillna**: Fill in missing data with some value or using an interpolation method such as'ffill'or'bfill'.  
* **isnull**: return boolean values indicating which values are missing/NA.  
* **notnull**: Negation of isnull.

In [5]:
string_data.fillna(0)

0       0
1      bb
2     ccc
3       0
4    dddd
dtype: object

In [6]:
string_data.ffill() # NaN filled same as previous value

0    None
1      bb
2     ccc
3     ccc
4    dddd
dtype: object

In [7]:
string_data.bfill() # NaN filled same as later value

0      bb
1      bb
2     ccc
3    dddd
4    dddd
dtype: object

In [8]:
string_data.dropna()

1      bb
2     ccc
4    dddd
dtype: object

## Filtering Out Missing Data

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3, 4, NA, 5])

In [11]:
data.dropna()

0    1.0
2    3.0
3    4.0
5    5.0
dtype: float64

In [12]:
data[data.isnull()]

1   NaN
4   NaN
dtype: float64

In [13]:
data[data.notnull()] # Equivalent to dropna().

0    1.0
2    3.0
3    4.0
5    5.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows or columns that are all NA or only those containing any NAs.

In [14]:
data = pd.DataFrame([[1., 2., 3.], 
                     [4., NA, NA],
                     [NA, NA, NA], 
                     [NA, 11., 12.]])
data

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  11.0  12.0

> *dropna() by default drops any row containing a missing value*

In [15]:
data.dropna()

     0    1    2
0  1.0  2.0  3.0

> *passing **how='all'** will only drop rows that are all NaN.*

In [16]:
data.dropna(how='all')

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
3  NaN  11.0  12.0

In [17]:
data['4'] = NA

In [18]:
data

     0     1     2   4
0  1.0   2.0   3.0 NaN
1  4.0   NaN   NaN NaN
2  NaN   NaN   NaN NaN
3  NaN  11.0  12.0 NaN

> To drop columns in the same way, pass **axis=1**.

In [19]:
data.dropna(axis=1, how='all')

     0     1     2
0  1.0   2.0   3.0
1  4.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  11.0  12.0

If we only want to keep rows containing a certain number of observations. We can add **thresh** augument.

In [20]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.515779       NaN       NaN
1 -0.050850       NaN       NaN
2  0.059893       NaN  1.325651
3 -1.160278       NaN  1.034061
4  0.966224  0.518087 -0.436198
5  0.803092  0.695176  1.133155
6  1.119618  0.299354 -2.031910

In [21]:
df.dropna() # drop all the rows contains NaN

          0         1         2
4  0.966224  0.518087 -0.436198
5  0.803092  0.695176  1.133155
6  1.119618  0.299354 -2.031910

In [22]:
df[3] = NA
df[3].astype('float')
df

          0         1         2   3
0 -0.515779       NaN       NaN NaN
1 -0.050850       NaN       NaN NaN
2  0.059893       NaN  1.325651 NaN
3 -1.160278       NaN  1.034061 NaN
4  0.966224  0.518087 -0.436198 NaN
5  0.803092  0.695176  1.133155 NaN
6  1.119618  0.299354 -2.031910 NaN

In [23]:
df.dropna(thresh=3) # Keep only the rows with at least 3 non-na values:

          0         1         2   3
4  0.966224  0.518087 -0.436198 NaN
5  0.803092  0.695176  1.133155 NaN
6  1.119618  0.299354 -2.031910 NaN

## Filling In Missing Data

In [24]:
df

          0         1         2   3
0 -0.515779       NaN       NaN NaN
1 -0.050850       NaN       NaN NaN
2  0.059893       NaN  1.325651 NaN
3 -1.160278       NaN  1.034061 NaN
4  0.966224  0.518087 -0.436198 NaN
5  0.803092  0.695176  1.133155 NaN
6  1.119618  0.299354 -2.031910 NaN

In [25]:
df.fillna(0)

          0         1         2    3
0 -0.515779  0.000000  0.000000  0.0
1 -0.050850  0.000000  0.000000  0.0
2  0.059893  0.000000  1.325651  0.0
3 -1.160278  0.000000  1.034061  0.0
4  0.966224  0.518087 -0.436198  0.0
5  0.803092  0.695176  1.133155  0.0
6  1.119618  0.299354 -2.031910  0.0

> By passing a dictionary, can use different fill value for each column.

In [26]:
df.fillna({1: 0.9999, 2: 0.8888, 3:0.7777 })

          0         1         2       3
0 -0.515779  0.999900  0.888800  0.7777
1 -0.050850  0.999900  0.888800  0.7777
2  0.059893  0.999900  1.325651  0.7777
3 -1.160278  0.999900  1.034061  0.7777
4  0.966224  0.518087 -0.436198  0.7777
5  0.803092  0.695176  1.133155  0.7777
6  1.119618  0.299354 -2.031910  0.7777

> fillna returns a new object, but add argument inplace=Ture will change inplace.

In [27]:
df.fillna(0, inplace=True)
df

          0         1         2    3
0 -0.515779  0.000000  0.000000  0.0
1 -0.050850  0.000000  0.000000  0.0
2  0.059893  0.000000  1.325651  0.0
3 -1.160278  0.000000  1.034061  0.0
4  0.966224  0.518087 -0.436198  0.0
5  0.803092  0.695176  1.133155  0.0
6  1.119618  0.299354 -2.031910  0.0

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.638889 -0.628628  0.227867
1 -1.754156 -0.849572  0.499041
2  0.203560       NaN  0.121463
3 -0.383999       NaN  0.258524
4  0.650574       NaN       NaN
5  0.912157       NaN       NaN

In [29]:
df.fillna(method='ffill') # fill the value the same as upper one.

          0         1         2
0  0.638889 -0.628628  0.227867
1 -1.754156 -0.849572  0.499041
2  0.203560 -0.849572  0.121463
3 -0.383999 -0.849572  0.258524
4  0.650574 -0.849572  0.258524
5  0.912157 -0.849572  0.258524

* **value**: Scalar value or dict-like object to use to  ll missing values
* **method**: Interpolation; by default'ffill'if function called with no other 
* **axis**: arguments Axis to  ll on; defaultaxis=0
* **inplace**: Modify the calling object without producing a copy
* **limit**: For forward and backward  lling, maximum number of consecutive periods to  ll

# 2. Data Transformation

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

The DataFrame method duplicated returns a boolean Series indicating whether each row is a duplicate or not.

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

drop_duplicates returns a DataFrame where the duplicated array is False

In [41]:
data.loc[~data.duplicated()]
# equal to drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

duplicated and drop_duplicates by default keep the first observed value combina tion. Passing keep='last' will return the last one.

## Transforming Data Using a Function or Mapping

In [43]:
dict = {
'food': [
    'bacon', 'pulled pork', 'bacon',
    'Pastrami', 'corned beef', 'Bacon',
    'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
}

data = pd.DataFrame(dict)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [52]:
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

Convert each value of food to lowercase using **str.lower** Series method.

In [60]:
lowercase_food = data['food'].str.lower()
type(lowercase_food)

pandas.core.series.Series

In [63]:
data['animal'] = lowercase_food.map(meat_to_animal)
# pass a dict-like object

The map method on a Series accepts a **function** or **dict-like object** containing a mapping.

In [64]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [65]:
# or pass a function
lowercase_food.map(lambda x: meat_to_animal[x])
# or 
# data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations and other data cleaningrelated operations.

## Replacing Values
Filling in missing data with the fillna method is a special case of more general value replacement. As youve already seen, map can be used to modify a subset of values in an object but replace provides a simpler and more flexible way to do so

In [68]:
data = pd.Series([1,2,3,999,4,999,5,999,6])
data

0      1
1      2
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [69]:
data.replace(999, np.nan)

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
6    5.0
7    NaN
8    6.0
dtype: float64

In [73]:
data.replace([1,2], 100)

0    100
1    100
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [74]:
data.replace([1,2], [100,200])

0    100
1    200
2      3
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

In [76]:
data.replace({
    1: 100,
    2: 200,
    3: 300
})

0    100
1    200
2    300
3    999
4      4
5    999
6      5
7    999
8      6
dtype: int64

## Renaming Axis Indexes

In [92]:
index = ['aaa', 'bbb','ccc']
columns = ['one', 'two', 'three', 'four']
data = pd.DataFrame(np.arange(12).reshape((3,4)), index=index, columns=columns)
data

     one  two  three  four
aaa    0    1      2     3
bbb    4    5      6     7
ccc    8    9     10    11

In [93]:
data.index = data.index.map(lambda x: x.upper())
data

     one  two  three  four
AAA    0    1      2     3
BBB    4    5      6     7
CCC    8    9     10    11

In [94]:
mapping = {
    'one': '1',
    'two': '2',
    'three': '3',
    'four': '4'
}
data.columns.map(lambda x: mapping[x])

Index(['1', '2', '3', '4'], dtype='object')

In [102]:
data.rename(index=str.title, columns=str.upper)

     ONE  TWO  THREE  FOUR
Aaa    0    1      2     3
Bbb    4    5      6     7
Ccc    8    9     10    11

In [105]:
data.rename(index={'AAA': 'aa'}, columns={'three': 'Three'}, inplace=True)
data

     one  two  Three  four
aa     0    1      2     3
BBB    4    5      6     7
CCC    8    9     10    11

## ? Discretization and Binning ?

In [106]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
# divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Pandas returns a special **Categorical object**

In [107]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [109]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [113]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [114]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

....

....

....

## Detecting and Filtering Outliers

In [151]:
data = pd.DataFrame(np.random.randn(1000, 4))
# random Gaussian distribution of shape(1000,4)

In [152]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.004552    -0.049406    -0.009794    -0.025166
std       0.996295     1.027764     1.006155     0.977289
min      -4.487973    -3.017524    -3.382677    -3.396405
25%      -0.657822    -0.752725    -0.696109    -0.722000
50%       0.006095    -0.048865     0.007337    -0.002275
75%       0.666298     0.620426     0.679637     0.671717
max       4.062071     3.193499     2.939756     2.909528

In [153]:
col_1 = data[0]
col_1[np.abs(col_1)>3]

102    4.062071
840   -4.487973
934   -3.424243
Name: 0, dtype: float64

In [154]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
102  4.062071 -1.569281  0.242881 -0.455853
131 -1.299427 -0.703381  0.477630 -3.002006
133  0.146192  0.011887 -3.382677  0.059334
431  0.860935  3.193499  0.941298  0.143213
458  0.496617  3.016509  0.173362 -0.256756
519  0.346485  3.025185  1.297486  0.487962
597  1.460854 -0.632964  0.166555 -3.396405
680  1.481884 -3.017524  0.478526  0.386790
840 -4.487973 -0.295081  0.021206  0.329064
934 -3.424243  0.428276  0.132066  1.059025

In [155]:
data.loc[(np.abs((data[0]+data[1]+data[2]+data[3]))>3)]
# select sum greater than 3

            0         1         2         3
3   -1.643039 -1.886616 -1.543687  1.416133
4   -1.519462 -1.009138 -2.132722  1.044766
14  -1.272188 -1.889835 -0.958795 -0.806980
15  -0.366834 -0.958923 -0.598001 -1.380064
25   1.899774 -0.995992  2.099647  0.887807
34   1.035679  0.470962  2.590022 -0.723403
40  -2.674425 -0.292910 -0.847287  0.217521
57   0.624201  0.581881  1.501699  0.638116
77  -2.202890 -0.946470 -1.273535  0.990288
87  -0.294196 -1.761115 -2.466304 -1.373948
90   1.261135  0.786829  0.962453  0.915348
100  0.548925  1.497535  1.790194 -0.471375
113 -1.821516 -0.560077  0.003572 -1.237702
131 -1.299427 -0.703381  0.477630 -3.002006
133  0.146192  0.011887 -3.382677  0.059334
145 -1.327560 -0.800380 -0.937503 -0.613562
159 -0.418551 -1.286573 -0.813569 -0.714390
170 -1.473915 -0.624437 -0.833852 -0.829621
173 -1.054997 -1.899877 -0.036417 -0.155160
179 -0.406591 -1.134700 -0.271402 -1.641617
206 -1.949126 -2.846880 -0.139679 -0.409135
226  0.169710 -1.731163 -0.198402 -1.273386
232 -0.026824  1.242104  1.140554  1.222969
258 -0.824291 -0.521533 -0.083449 -1.624844
264 -1.956155 -0.408529 -1.741649  0.688468
266 -1.533945 -1.940438  0.587528 -0.453206
278 -2.388207 -0.620563 -0.275782 -1.819113
284 -1.832785 -1.079025 -0.669120 -0.568476
303 -0.194393  2.561649  1.169708  0.687111
312  1.534678  2.275365 -0.565648  0.136698
..        ...       ...       ...       ...
804 -0.648199  1.661593  2.262519  1.384871
809  0.480934  0.209731  0.729830  2.183256
816  1.020643 -0.855559 -2.696652 -1.699235
822  0.064370 -1.710109 -1.537864 -0.088959
823  1.443889  0.875473  2.414834  1.109334
827 -2.639746 -2.651132  1.262462 -0.428034
833  0.631860  0.119236 -2.911333 -1.211717
834  1.770620  0.498444 -0.572573  1.393879
840 -4.487973 -0.295081  0.021206  0.329064
845 -1.098385 -2.213415  1.177869 -1.061844
848 -1.439692 -1.385341 -0.301214 -0.193820
873 -1.441533 -1.822906 -1.088943 -0.771687
877 -2.523775 -0.893183 -1.309808  0.843473
882 -0.289833  0.608264 -0.774327 -2.603142
889  1.167448  0.237344  1.191115  1.699952
892 -0.820688 -1.052074 -0.722442 -2.451715
893  1.146271 -0.043801  0.490932  2.909528
906  0.481149  1.098559  0.791150  1.298973
917 -1.435535 -1.603805 -1.504358 -1.388904
921 -0.634006  1.243393  0.838734  1.932462
925  0.865553 -0.823676  1.508094  1.625970
932 -0.903347 -0.269713 -1.441552 -1.025414
935  0.350933  0.224264  1.797670  0.678087
942 -0.337521 -1.184374  0.153850 -2.143278
955  1.143956  1.760904  2.653370 -1.076798
959  0.283125 -2.442474 -1.623633 -0.656004
964  1.310632  2.205162 -0.140763  1.023823
974 -0.168830 -1.533246 -1.151438 -0.344367
995 -2.522310 -0.398226 -0.823285 -1.200308
997  0.810393  0.832029  0.734452  1.147687

[136 rows x 4 columns]

In [156]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
102  4.062071 -1.569281  0.242881 -0.455853
131 -1.299427 -0.703381  0.477630 -3.002006
133  0.146192  0.011887 -3.382677  0.059334
431  0.860935  3.193499  0.941298  0.143213
458  0.496617  3.016509  0.173362 -0.256756
519  0.346485  3.025185  1.297486  0.487962
597  1.460854 -0.632964  0.166555 -3.396405
680  1.481884 -3.017524  0.478526  0.386790
840 -4.487973 -0.295081  0.021206  0.329064
934 -3.424243  0.428276  0.132066  1.059025

## ? Permutation and Random Sampling ?

## Computing Indicator/Dummy Variables

In [164]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [165]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [167]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0